<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d1c4bdfacf7f3f79788536509a120a2f9c40318d2d6f9a604095c6fbac021bd6","plan_job_ref":"Job Run Terraform plan in staging #7 at https://github.com/GSA-TTS/review-repro/actions/runs/12711701352","plan_out_hash":"5f91c28149be143780d526b6db88d7527e0dfdabf8271a51073a97e7dea997b9","plan_hash":"f0a4a3f1835aad97641bf55448bfe67bf437a38a5bfd71c04f71c6ddcc7a0e7c","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.app will be created
+   resource "cloudfoundry_app" "app" {
+       buildpacks                  = [
+           "ruby_buildpack",
        ]
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       environment                 = {
+           "RAILS_ENV"                = "staging"
+           "RAILS_LOG_TO_STDOUT"      = "true"
+           "RAILS_MASTER_KEY"         = (sensitive value)
+           "RAILS_SERVE_STATIC_FILES" = "true"
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
+       name                        = "review_repro-staging"
+       org_name                    = "gsa-tts-devtools-prototyping"
+       path                        = "./dist/src.zip"
+       processes                   = [
+           {
+               command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_type           = (known after apply)
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
+       routes                      = [
+           {
+               protocol = (known after apply)
+               route    = "review_repro-staging.app.cloud.gov"
            },
        ]
+       service_bindings            = [
+           {
+               service_instance = "review_repro-rds-staging"
            },
        ]
+       source_code_hash            = "LevyclEiowf4FX/RwyOnHuwwskTSj9dfj374otX0ZxI="
+       space_name                  = "review-repro-stage"
+       stack                       = (known after apply)
+       strategy                    = "blue-green"
+       updated_at                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #7](https://github.com/GSA-TTS/review-repro/actions/runs/12711701352)